#define _CRT_SECURE_NO_WARNINGS 1

//1 求复合条件整数集
//给定不大于5的正整数n，考虑由n开始的连续5个数字，输出所有由他们组成的无重复数字的3位数
//输入样例：
//5
//输出样例：
//567 568 569 576 578 579
//586 587 589 596 597 598
//657 658 659 675 678 679
//685 687 689 695 697 698
//756 758 759 765 768 769
//785 786 789 795 796 798
//856 857 859 865 867 869
//875 876 879 895 896 897
//956 957 958 965 967 968
//975 976 978 985 986 987
//
//参考代码：

#include <stdio.h>

int main()
{
	int j, k;
	int n = 5;
	int inc = 0;
	int i = n;
	//      j = k = n;    注意j,k变量定义的位置
	while (i < n + 5)
	{
		j = n;
		while (j < n + 5)
		{
			k = n;
			while (k < n + 5)
			{
				if (i != j && i != k && j != k){
					printf("%d%d%d", i, j, k);
					inc++;
					if (inc == 6)
					{
						printf("\n");
						inc = 0;
					}
					else{
						printf("\t");  //注意区分空格和\t效果
					}
				}
				k++;
			}
			j++;
		}
		i++;
	}
	return 0;
}
