#define _CRT_SECURE_NO_WARNINGS 1
//数据结构前言（简单了解）

//1.数据结构？
//（1）数据
//例如：一个班级的学生信息，或者某个地区人口普查表（记录一个地区的每一个人口的信息），这些信息的集合我们称之为 一组数据
//      平常我们的数字（1.2.3.4.5.6.7.8.9.）也是数据--》用以表示数据类型的数据
//      网页：中的图片，数字，文字，也是数据，（这些都是网页里面的数据）
//（2)结构
//引用：高中化学中我们了解到分子结构
//      分子结构：分子之间的组织关系
//      这种组织关系我们便可以把他当作结构 
//结构：组织关系	
//（3）数据结构=数据+结构
//     我们主要研究：数据和数据之间的组织关系
//     官方解释：数据结构(Data Structure)是计算机存储、组织数据的方式，指相互之间存在一种或多种特定关系的数据元素的集合。
//     回忆：我们在c语言中的学习的数组，数组里面可以存储许多数据，那些数据是按照顺序这种方式组织到一段连续的存储空间，这个也可以看成简单的数据组织关系

//延申：什么是程序？
//      数据 + 算法（对数据进行操作）（函数）

//数据结构可以通过一种合理的方式将程序里面的数据高效的组织起来，再提供一些方法去操作这些数据，这样一个程序就算完成
//例如：我们写过的通讯录中
//      通讯录：一些人的联系方式信息，这就是一组数据
//             在这个基础上我们写了一些 增删查改（这些函数）就是 算法
//算法：对一定的数据进行操作
//      官方解释：算法(Algorithm):就是定义良好的计算过程，他取一个或一组的值为输入，并产生出一个或一组值作为输出。简单来说算法就是一系列的计算步骤，用来将输入数据转化成输出结果。
//      理解：按照一些特定的步骤，把这些特定的步骤通过语言的方式转化成指令，让计算机执行，这样的一个过程我们便可以理解为一个算法
//      例如：


